The output of the operation is longer than the comment limit in Github, please look at the full plan in the action run:
https://github.com/ministryofjustice/dso-azure-automation-accounts/actions/runs/2094803748
Output from Terraform plan before Apply
```[command]/home/runner/work/_temp/19153b9d-51c3-4f10-9dd5-7042efaf0d7a/terraform-bin plan -refresh=false -no-color -out=plan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.automation_account["nomis-bip-t1"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"
        name                     = "nomis-bip-t1-automation-account"
      ~ tags                     = {
          + "application"            = "BI"
          + "environment_name"       = "T1"
          + "service"                = "NOMIS"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/start-vms"
        name                    = "start-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/stop-vms"
        name                    = "stop-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account" -> (known after apply)
      ~ tags                = {
          + "application"            = "BI"
          + "environment_name"       = "T1"
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "service"                = "NOMIS"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement
      ~ workspace_name      = "nomis-bip-t1-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "nomis-bip-t1-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "nomis-bip-t1" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "4494a597-9002-4499-af4f-21c145107ff6" -> null
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account|nomis-bip-t1-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        name                       = "nomis-bip-t1-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ query                   = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
          + | where Resource =~ "nomis-bip-t1-automation-account"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"
        name                     = "t1-oasys-automation-account"
      ~ tags                     = {
          + "application"            = "OASys"
          + "environment_name"       = "T1"
          + "service"                = "OASys"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/start-vms"
        name                    = "start-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/stop-vms"
        name                    = "stop-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account" -> (known after apply)
      ~ tags                = {
          + "application"            = "OASys"
          + "environment_name"       = "T1"
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "service"                = "OASys"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement
      ~ workspace_name      = "t1-oasys-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "t1-oasys-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "t1-oasys" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "4955256f-c1ac-4808-8666-b9b38b77d1d7" -> null
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account|t1-oasys-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        name                       = "t1-oasys-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ query                   = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
          + | where Resource =~ "t1-oasys-automation-account"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account"
        name                     = "t1-prisonnomis-automation-account"
      ~ tags                     = {
          + "application"            = "NOMIS"
          + "environment_name"       = "T1"
          + "service"                = "NOMIS"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/start-vms"
        name                    = "start-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/stop-vms"
        name                    = "stop-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account" -> (known after apply)
      ~ tags                = {
          + "application"            = "NOMIS"
          + "environment_name"       = "T1"
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "service"                = "NOMIS"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement
      ~ workspace_name      = "t1-prisonnomis-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "t1-prisonnomis-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "t1-prisonnomis" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "04ef066a-825e-4e4e-8aa6-edc6cedbdb49" -> null
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account|t1-prisonnomis-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        name                       = "t1-prisonnomis-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ query                   = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
          + | where Resource =~ "t1-prisonnomis-automation-account"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"
        name                     = "t2-oasys-automation-account"
      ~ tags                     = {
          + "application"            = "OASys"
          + "environment_name"       = "T2"
          + "service"                = "OASys"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"
        name                    = "start-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"
        name                    = "stop-vms"
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account" -> (known after apply)
      ~ tags                = {
          + "application"            = "OASys"
          + "environment_name"       = "T2"
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "service"                = "OASys"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement
      ~ workspace_name      = "t2-oasys-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "t2-oasys-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "t2-oasys" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "c8500975-4f8b-4e04-9cf1-c0c89a42ee5c" -> null
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account|t2-oasys-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        name                       = "t2-oasys-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ query                   = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
          + | where Resource =~ "t2-oasys-automation-account"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      ~ tags                    = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 24 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"%0A        name                     = "nomis-bip-t1-automation-account"%0A      ~ tags                     = {%0A          + "application"            = "BI"%0A          + "environment_name"       = "T1"%0A          + "service"                = "NOMIS"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account" -> (known after apply)%0A      ~ tags                = {%0A          + "application"            = "BI"%0A          + "environment_name"       = "T1"%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "service"                = "NOMIS"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement%0A      ~ workspace_name      = "nomis-bip-t1-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "nomis-bip-t1-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "nomis-bip-t1" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "4494a597-9002-4499-af4f-21c145107ff6" -> null%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account|nomis-bip-t1-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        name                       = "nomis-bip-t1-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-t1-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ query                   = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A          + | where Resource =~ "nomis-bip-t1-automation-account"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (10 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"%0A        name                     = "t1-oasys-automation-account"%0A      ~ tags                     = {%0A          + "application"            = "OASys"%0A          + "environment_name"       = "T1"%0A          + "service"                = "OASys"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account" -> (known after apply)%0A      ~ tags                = {%0A          + "application"            = "OASys"%0A          + "environment_name"       = "T1"%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "service"                = "OASys"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement%0A      ~ workspace_name      = "t1-oasys-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "t1-oasys-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "t1-oasys" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "4955256f-c1ac-4808-8666-b9b38b77d1d7" -> null%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account|t1-oasys-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        name                       = "t1-oasys-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.OperationalInsights/workspaces/t1-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ query                   = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A          + | where Resource =~ "t1-oasys-automation-account"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (10 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account"%0A        name                     = "t1-prisonnomis-automation-account"%0A      ~ tags                     = {%0A          + "application"            = "NOMIS"%0A          + "environment_name"       = "T1"%0A          + "service"                = "NOMIS"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account" -> (known after apply)%0A      ~ tags                = {%0A          + "application"            = "NOMIS"%0A          + "environment_name"       = "T1"%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "service"                = "NOMIS"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement%0A      ~ workspace_name      = "t1-prisonnomis-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "t1-prisonnomis-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "t1-prisonnomis" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "04ef066a-825e-4e4e-8aa6-edc6cedbdb49" -> null%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account|t1-prisonnomis-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        name                       = "t1-prisonnomis-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.OperationalInsights/workspaces/t1-prisonnomis-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test"%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ query                   = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A          + | where Resource =~ "t1-prisonnomis-automation-account"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (10 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"%0A        name                     = "t2-oasys-automation-account"%0A      ~ tags                     = {%0A          + "application"            = "OASys"%0A          + "environment_name"       = "T2"%0A          + "service"                = "OASys"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A      ~ tags                    = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account" -> (known after apply)%0A      ~ tags                = {%0A          + "application"            = "OASys"%0A          + "environment_name"       = "T2"%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "service"                = "OASys"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      ~ workspace_id        = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.OperationalInsights/workspaces/t2-oasys-automation-account" -> "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/noms-test-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-test" # forces replacement%0A      ~ workspace_name      = "t2-oasys-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace"```